coarse/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       10472;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       10492;
    }
    slip
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          220;
        startFace       10512;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          236;
        startFace       10732;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10720;
        startFace       10968;
    }
)

// ************************************************************************* //
