coarse/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         60;

deltaT          0.001;

writeControl    runTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    fieldAverage
    {
        type             fieldAverage;
        libs             (fieldFunctionObjects);
        executeControl   timeStep;
        executeInterval  1;
        writeControl     writeTime;
        writeInterval    1;
        startTime        0.1;

        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }

    residuals
    {
        type             solverInfo;
        libs             ("libutilityFunctionObjects.so");
        fields           (U p);
        executeControl   timeStep;
        writeResidualFields yes;
        executeInterval  1;
        writeControl     writeTime;
        writeInterval    1;
        startTime        0;
    }
}
// ************************************************************************* //
